s </w>
e </w>
i n
o n
a t
a n
, </w>
t </w>
e r
. </w>
e n
d </w>
r e
i c
r o
t h
c o
on </w>
d e
g </w>
" </w>
in g</w>
o r
a l
s t
an d</w>
e s</w>
i on</w>
f </w>
a </w>
p ro
( </w>
) </w>
m p
y </w>
i t
s o
d at
e l
c t
r a
m s</w>
u t
dat a</w>
u l
= </w>
a re</w>
co mp
u r
a r
p l
: </w>
re s
res ul
resul t</w>
_ _
comp ut
m a
u n
s y
f or
t o
n </w>
t w
en t
st e
l e
i s</w>
in t
m m
ic at
c h
er </w>
n on
non e</w>
c l
c e</w>
to </w>
l i
so f
sof tw
softw are</w>
al </w>
c e
e d</w>
s s</w>
g e</w>
th e</w>
o p
a b
{ </w>
} </w>
de f</w>
- </w>
v el
a p
sy ste
e ct
o w
a ge</w>
ch </w>
er ror
error </w>
s el
sel f</w>
f un
p </w>
in cl
incl u
__ </w>
f ic
fic i
i g
an g
t i
de vel
devel op
develop m
developm ent</w>
en ce</w>
a s</w>
c i
for </w>
le ar
ect s</w>
o f</w>
in e
l v
n e
a m
syste ms</w>
co mm
on s</w>
int er
pro g
prog ramm
ow </w>
pro ce
m </w>
e x
an d
s er
c k
ser v
fun ction</w>
; </w>
o v
ov er</w>
a ss</w>
en ab
st r
str u
stru ct
inclu de</w>
co de</w>
/ </w>
th at</w>
l y</w>
e f
ef fici
re t
ret ur
retur n</w>
co l
ma in</w>
s s
al g
alg or
algor ith
algorith ms</w>
ste p</w>
er s
li k
lik e</w>
an al
anal y
s ci
sci ence</w>
i z
inter ne
interne t</w>
en g
eng ine
engine er
engineer ing</w>
th e
the y</w>
comput er</w>
l </w>
l ang
lang u
langu age</w>
lear n</w>
h as</w>
f ro
fro m</w>
in v
inv o
invo lv
involv es</w>
w ith
h </w>
w i
u s
ap plication</w>
n am
programm ing</w>
comm un
commun icat
communicat e</w>
h ow</w>
t ran
tran s
trans for
man age</w>
reso ur
resour ces</w>
re q
req u
e c
in p
f i
v e</w>
a sy
asy n
asyn c
async </w>
t r
tr y</w>
c at
cat ch</w>
con so
conso le</w>
v ers
vers ion</w>
con tro
contro l</w>
g it</w>
tra ck
track </w>
ch ang
chang es</w>
so ur
sour ce</w>
ti m
tim e</w>
enab le</w>
col l
coll ab
collab oration</w>
h el
hel p</w>
pro j
proj ects</w>
cl ass</w>
__ in
__in it
__init __</w>
p ass</w>
dat e</w>
struct ures</w>
fun d
fund am
fundam ent
fundament al</w>
con ce
conce p
concep t
concept s</w>
or g
org an
organ iz
organiz e</w>
effici ent
efficient ly</w>
comm on</w>
ex amples</w>
ar ra
arra y
array s</w>
lin k
link ed</w>
li st
list s</w>
tre es</w>
g rap
grap h
graph s</w>
cl o
clo u
clou d</w>
prov i
provi des</w>
de mand</w>
a c
ac ce
acce ss</w>
serv ices</w>
in f
inf ra
infra struct
infrastruct ure</w>
pl at
plat for
platfor ms</w>
serv ice</w>
mach ine</w>
lear n
learn ing</w>
b ran
bran ch</w>
ar ti
arti fici
artifici al</w>
int el
intel lig
intellig ence</w>
enab les</w>
comput ers</w>
with o
witho ut</w>
b e
be ing</w>
ex plicit
explicit ly</w>
programm ed</w>
ap plicati
applicati ons</w>
i mage</w>
reco g
recog n
recogn ition</w>
n at
nat ural</w>
proce ss
process ing</w>
p re
pre d
pred icti
predicti ve</w>
analy tic
analytic s</w>
i mp
imp or
impor t</w>
o s</w>
sy s</w>
j son</w>
i f</w>
__ nam
__nam e
__name __</w>
__ ma
__ma in
__main __</w>
b y</w>
proce d
proced ures</w>
so lv
solv ing</w>
comput ati
computati on
computation al</w>
pro b
prob le
proble ms</w>
un derst
underst and
understand ing</w>
e ss
ess enti
essenti al</w>
w r
wr iting</w>
syste matic
systematic </w>
p r
pr in
prin ci
princi ples</w>
inclu des</w>
requ i
requi re
require m
requirem ent
requirement s</w>
analy s
analys is</w>
de s
des ig
desig n</w>
co d
cod ing</w>
t e
te sting</w>
ma inten
mainten an
maintenan ce</w>
fi le
p y
py th
pyth on</w>
h ig
hig h</w>
le vel</w>
k n
kn ow
know n</w>
it s</w>
s implicit
simplicit y</w>
re a
rea d
read ab
readab i
readabi lit
readabilit y</w>
wi dely</w>
us ed</w>
w e
we b
web </w>
a uto
auto mation</w>
transfor m
transform ed</w>
con d
cond u
condu ct</w>
b us
bus iness</w>
con nects</w>
b i
bi l
bil li
billi ons</w>
de v
dev ices</w>
w or
wor l
worl d
world wi
worldwi de</w>
th ro
thro u
throu g
throug h</w>
st and
stand ar
standar d
standard iz
standardiz ed</w>
pro to
proto col
protocol s</w>
op ti
opti ons</w>
c y
cy bers
cybers ec
cybersec ur
cybersecur it
cybersecurit y</w>
pro tects</w>
ne twor
networ k
network s</w>
d ig
dig it
digit al</w>
at t
att ack
attack s</w>
en c
enc r
encr y
encry p
encryp tion</w>
a uthentication</w>
th reat</w>
de tection</w>
ite ms</w>
ap is</w>
inter f
interf aces</w>
al l
all ow</w>
d i
di f
dif f
diff erent</w>
e ach</w>
o ther</w>
comp onent
component s</w>
s h
sh o
sho ul
shoul d</w>
v al
val u
valu e</w>
con fig</w>
ur l</w>
p arams</w>
nam e</w>
inp ut
input _
input_ data</w>
file _
file_ p
file_p ath</w>
vali date</w>
h and
ex ec
exec ute</w>
op eration</w>
hand le</w>
requ e
reque st</w>
l o
s e
lo a
g er</w>
p ar
ch eck
check </w>
con v
conv er
conver t</w>
c al
cal c
calc ul
calcul ate</w>
fin d</w>
fi l
fil ter</w>
man a
mana ger</w>
loa d</w>
u p
up date</w>
dele te</w>
se ar
sear ch</w>
f e
fe t
fet ch</w>
for mat</w>
sor t</w>
s a
sa ve</w>
s plit</w>
c reate</w>
par se</w>
m er
mer ge</w>
par ser</w>
dat ab
datab a
databa se
database manager</w>
con fig
config loa
configloa der</w>
vali dator
validator </w>
ap icli
apicli ent</w>
dat aprocessor
dataprocessor </w>
c ach
cach e
cache manager</w>
file hand
filehand ler</w>
lo g
log ger</w>