{
  "<pad>": 0,
  "<unk>": 1,
  "<bos>": 2,
  "<eos>": 3,
  "<sep>": 4,
  "<mask>": 5,
  "<code>": 6,
  "</code>": 7,
  "\"": 8,
  "(": 9,
  ")": 10,
  ",": 11,
  "-": 12,
  ".": 13,
  "/": 14,
  ":": 15,
  ";": 16,
  "</w>": 17,
  "=": 18,
  "_": 19,
  "a": 20,
  "b": 21,
  "c": 22,
  "d": 23,
  "e": 24,
  "f": 25,
  "g": 26,
  "h": 27,
  "i": 28,
  "j": 29,
  "k": 30,
  "l": 31,
  "m": 32,
  "n": 33,
  "o": 34,
  "p": 35,
  "q": 36,
  "r": 37,
  "s": 38,
  "t": 39,
  "u": 40,
  "v": 41,
  "w": 42,
  "x": 43,
  "y": 44,
  "z": 45,
  "{": 46,
  "}": 47,
  "s</w>": 48,
  "e</w>": 49,
  "in": 50,
  "on": 51,
  "at": 52,
  "an": 53,
  ",</w>": 54,
  "t</w>": 55,
  "er": 56,
  ".</w>": 57,
  "en": 58,
  "d</w>": 59,
  "re": 60,
  "ic": 61,
  "ro": 62,
  "th": 63,
  "co": 64,
  "on</w>": 65,
  "de": 66,
  "g</w>": 67,
  "\"</w>": 68,
  "ing</w>": 69,
  "or": 70,
  "al": 71,
  "st": 72,
  "and</w>": 73,
  "es</w>": 74,
  "ion</w>": 75,
  "f</w>": 76,
  "a</w>": 77,
  "pro": 78,
  "(</w>": 79,
  ")</w>": 80,
  "mp": 81,
  "y</w>": 82,
  "it": 83,
  "so": 84,
  "dat": 85,
  "el": 86,
  "ct": 87,
  "ra": 88,
  "ms</w>": 89,
  "ut": 90,
  "data</w>": 91,
  "ul": 92,
  "=</w>": 93,
  "are</w>": 94,
  "comp": 95,
  "ur": 96,
  "ar": 97,
  "pl": 98,
  ":</w>": 99,
  "res": 100,
  "resul": 101,
  "result</w>": 102,
  "__": 103,
  "comput": 104,
  "ma": 105,
  "un": 106,
  "sy": 107,
  "for": 108,
  "to": 109,
  "n</w>": 110,
  "tw": 111,
  "ent": 112,
  "ste": 113,
  "le": 114,
  "is</w>": 115,
  "int": 116,
  "mm": 117,
  "icat": 118,
  "ch": 119,
  "er</w>": 120,
  "non": 121,
  "none</w>": 122,
  "cl": 123,
  "ce</w>": 124,
  "to</w>": 125,
  "li": 126,
  "sof": 127,
  "softw": 128,
  "software</w>": 129,
  "al</w>": 130,
  "ce": 131,
  "ed</w>": 132,
  "ss</w>": 133,
  "ge</w>": 134,
  "the</w>": 135,
  "op": 136,
  "ab": 137,
  "{</w>": 138,
  "}</w>": 139,
  "def</w>": 140,
  "-</w>": 141,
  "vel": 142,
  "ap": 143,
  "syste": 144,
  "ect": 145,
  "ow": 146,
  "age</w>": 147,
  "ch</w>": 148,
  "error": 149,
  "error</w>": 150,
  "sel": 151,
  "self</w>": 152,
  "fun": 153,
  "p</w>": 154,
  "incl": 155,
  "inclu": 156,
  "__</w>": 157,
  "fic": 158,
  "fici": 159,
  "ig": 160,
  "ang": 161,
  "ti": 162,
  "devel": 163,
  "develop": 164,
  "developm": 165,
  "development</w>": 166,
  "ence</w>": 167,
  "as</w>": 168,
  "ci": 169,
  "for</w>": 170,
  "lear": 171,
  "ects</w>": 172,
  "of</w>": 173,
  "ine": 174,
  "lv": 175,
  "ne": 176,
  "am": 177,
  "systems</w>": 178,
  "comm": 179,
  "ons</w>": 180,
  "inter": 181,
  "prog": 182,
  "programm": 183,
  "ow</w>": 184,
  "proce": 185,
  "m</w>": 186,
  "ex": 187,
  "and": 188,
  "ser": 189,
  "ck": 190,
  "serv": 191,
  "function</w>": 192,
  ";</w>": 193,
  "ov": 194,
  "over</w>": 195,
  "ass</w>": 196,
  "enab": 197,
  "str": 198,
  "stru": 199,
  "struct": 200,
  "include</w>": 201,
  "code</w>": 202,
  "/</w>": 203,
  "that</w>": 204,
  "ly</w>": 205,
  "ef": 206,
  "effici": 207,
  "ret": 208,
  "retur": 209,
  "return</w>": 210,
  "col": 211,
  "main</w>": 212,
  "ss": 213,
  "alg": 214,
  "algor": 215,
  "algorith": 216,
  "algorithms</w>": 217,
  "step</w>": 218,
  "ers": 219,
  "lik": 220,
  "like</w>": 221,
  "anal": 222,
  "analy": 223,
  "sci": 224,
  "science</w>": 225,
  "iz": 226,
  "interne": 227,
  "internet</w>": 228,
  "eng": 229,
  "engine": 230,
  "engineer": 231,
  "engineering</w>": 232,
  "the": 233,
  "they</w>": 234,
  "computer</w>": 235,
  "l</w>": 236,
  "lang": 237,
  "langu": 238,
  "language</w>": 239,
  "learn</w>": 240,
  "has</w>": 241,
  "fro": 242,
  "from</w>": 243,
  "inv": 244,
  "invo": 245,
  "involv": 246,
  "involves</w>": 247,
  "with": 248,
  "h</w>": 249,
  "wi": 250,
  "us": 251,
  "application</w>": 252,
  "nam": 253,
  "programming</w>": 254,
  "commun": 255,
  "communicat": 256,
  "communicate</w>": 257,
  "how</w>": 258,
  "tran": 259,
  "trans": 260,
  "transfor": 261,
  "manage</w>": 262,
  "resour": 263,
  "resources</w>": 264,
  "req": 265,
  "requ": 266,
  "ec": 267,
  "inp": 268,
  "fi": 269,
  "ve</w>": 270,
  "asy": 271,
  "asyn": 272,
  "async": 273,
  "async</w>": 274,
  "tr": 275,
  "try</w>": 276,
  "cat": 277,
  "catch</w>": 278,
  "conso": 279,
  "console</w>": 280,
  "vers": 281,
  "version</w>": 282,
  "contro": 283,
  "control</w>": 284,
  "git</w>": 285,
  "track": 286,
  "track</w>": 287,
  "chang": 288,
  "changes</w>": 289,
  "sour": 290,
  "source</w>": 291,
  "tim": 292,
  "time</w>": 293,
  "enable</w>": 294,
  "coll": 295,
  "collab": 296,
  "collaboration</w>": 297,
  "hel": 298,
  "help</w>": 299,
  "proj": 300,
  "projects</w>": 301,
  "class</w>": 302,
  "__in": 303,
  "__init": 304,
  "__init__</w>": 305,
  "pass</w>": 306,
  "date</w>": 307,
  "structures</w>": 308,
  "fund": 309,
  "fundam": 310,
  "fundament": 311,
  "fundamental</w>": 312,
  "conce": 313,
  "concep": 314,
  "concept": 315,
  "concepts</w>": 316,
  "org": 317,
  "organ": 318,
  "organiz": 319,
  "organize</w>": 320,
  "efficient": 321,
  "efficiently</w>": 322,
  "common</w>": 323,
  "examples</w>": 324,
  "arra": 325,
  "array": 326,
  "arrays</w>": 327,
  "link": 328,
  "linked</w>": 329,
  "list": 330,
  "lists</w>": 331,
  "trees</w>": 332,
  "grap": 333,
  "graph": 334,
  "graphs</w>": 335,
  "clo": 336,
  "clou": 337,
  "cloud</w>": 338,
  "provi": 339,
  "provides</w>": 340,
  "demand</w>": 341,
  "ac": 342,
  "acce": 343,
  "access</w>": 344,
  "services</w>": 345,
  "inf": 346,
  "infra": 347,
  "infrastruct": 348,
  "infrastructure</w>": 349,
  "plat": 350,
  "platfor": 351,
  "platforms</w>": 352,
  "service</w>": 353,
  "machine</w>": 354,
  "learn": 355,
  "learning</w>": 356,
  "bran": 357,
  "branch</w>": 358,
  "arti": 359,
  "artifici": 360,
  "artificial</w>": 361,
  "intel": 362,
  "intellig": 363,
  "intelligence</w>": 364,
  "enables</w>": 365,
  "computers</w>": 366,
  "witho": 367,
  "without</w>": 368,
  "be": 369,
  "being</w>": 370,
  "explicit": 371,
  "explicitly</w>": 372,
  "programmed</w>": 373,
  "applicati": 374,
  "applications</w>": 375,
  "image</w>": 376,
  "recog": 377,
  "recogn": 378,
  "recognition</w>": 379,
  "nat": 380,
  "natural</w>": 381,
  "process": 382,
  "processing</w>": 383,
  "pre": 384,
  "pred": 385,
  "predicti": 386,
  "predictive</w>": 387,
  "analytic": 388,
  "analytics</w>": 389,
  "imp": 390,
  "impor": 391,
  "import</w>": 392,
  "os</w>": 393,
  "sys</w>": 394,
  "json</w>": 395,
  "if</w>": 396,
  "__nam": 397,
  "__name": 398,
  "__name__</w>": 399,
  "__ma": 400,
  "__main": 401,
  "__main__</w>": 402,
  "by</w>": 403,
  "proced": 404,
  "procedures</w>": 405,
  "solv": 406,
  "solving</w>": 407,
  "computati": 408,
  "computation": 409,
  "computational</w>": 410,
  "prob": 411,
  "proble": 412,
  "problems</w>": 413,
  "underst": 414,
  "understand": 415,
  "understanding</w>": 416,
  "ess": 417,
  "essenti": 418,
  "essential</w>": 419,
  "wr": 420,
  "writing</w>": 421,
  "systematic": 422,
  "systematic</w>": 423,
  "pr": 424,
  "prin": 425,
  "princi": 426,
  "principles</w>": 427,
  "includes</w>": 428,
  "requi": 429,
  "require": 430,
  "requirem": 431,
  "requirement": 432,
  "requirements</w>": 433,
  "analys": 434,
  "analysis</w>": 435,
  "des": 436,
  "desig": 437,
  "design</w>": 438,
  "cod": 439,
  "coding</w>": 440,
  "te": 441,
  "testing</w>": 442,
  "mainten": 443,
  "maintenan": 444,
  "maintenance</w>": 445,
  "file": 446,
  "py": 447,
  "pyth": 448,
  "python</w>": 449,
  "hig": 450,
  "high</w>": 451,
  "level</w>": 452,
  "kn": 453,
  "know": 454,
  "known</w>": 455,
  "its</w>": 456,
  "simplicit": 457,
  "simplicity</w>": 458,
  "rea": 459,
  "read": 460,
  "readab": 461,
  "readabi": 462,
  "readabilit": 463,
  "readability</w>": 464,
  "widely</w>": 465,
  "used</w>": 466,
  "we": 467,
  "web": 468,
  "web</w>": 469,
  "auto": 470,
  "automation</w>": 471,
  "transform": 472,
  "transformed</w>": 473,
  "cond": 474,
  "condu": 475,
  "conduct</w>": 476,
  "bus": 477,
  "business</w>": 478,
  "connects</w>": 479,
  "bi": 480,
  "bil": 481,
  "billi": 482,
  "billions</w>": 483,
  "dev": 484,
  "devices</w>": 485,
  "wor": 486,
  "worl": 487,
  "world": 488,
  "worldwi": 489,
  "worldwide</w>": 490,
  "thro": 491,
  "throu": 492,
  "throug": 493,
  "through</w>": 494,
  "stand": 495,
  "standar": 496,
  "standard": 497,
  "standardiz": 498,
  "standardized</w>": 499,
  "proto": 500,
  "protocol": 501,
  "protocols</w>": 502,
  "opti": 503,
  "options</w>": 504,
  "cy": 505,
  "cybers": 506,
  "cybersec": 507,
  "cybersecur": 508,
  "cybersecurit": 509,
  "cybersecurity</w>": 510,
  "protects</w>": 511,
  "networ": 512,
  "network": 513,
  "networks</w>": 514,
  "dig": 515,
  "digit": 516,
  "digital</w>": 517,
  "att": 518,
  "attack": 519,
  "attacks</w>": 520,
  "enc": 521,
  "encr": 522,
  "encry": 523,
  "encryp": 524,
  "encryption</w>": 525,
  "authentication</w>": 526,
  "threat</w>": 527,
  "detection</w>": 528,
  "items</w>": 529,
  "apis</w>": 530,
  "interf": 531,
  "interfaces</w>": 532,
  "all": 533,
  "allow</w>": 534,
  "di": 535,
  "dif": 536,
  "diff": 537,
  "different</w>": 538,
  "each</w>": 539,
  "other</w>": 540,
  "component": 541,
  "components</w>": 542,
  "sh": 543,
  "sho": 544,
  "shoul": 545,
  "should</w>": 546,
  "val": 547,
  "valu": 548,
  "value</w>": 549,
  "config</w>": 550,
  "url</w>": 551,
  "params</w>": 552,
  "name</w>": 553,
  "input": 554,
  "input_": 555,
  "input_data</w>": 556,
  "file_": 557,
  "file_p": 558,
  "file_path</w>": 559,
  "validate</w>": 560,
  "hand": 561,
  "exec": 562,
  "execute</w>": 563,
  "operation</w>": 564,
  "handle</w>": 565,
  "reque": 566,
  "request</w>": 567,
  "lo": 568,
  "se": 569,
  "loa": 570,
  "ger</w>": 571,
  "par": 572,
  "check": 573,
  "check</w>": 574,
  "conv": 575,
  "conver": 576,
  "convert</w>": 577,
  "cal": 578,
  "calc": 579,
  "calcul": 580,
  "calculate</w>": 581,
  "find</w>": 582,
  "fil": 583,
  "filter</w>": 584,
  "mana": 585,
  "manager</w>": 586,
  "load</w>": 587,
  "up": 588,
  "update</w>": 589,
  "delete</w>": 590,
  "sear": 591,
  "search</w>": 592,
  "fe": 593,
  "fet": 594,
  "fetch</w>": 595,
  "format</w>": 596,
  "sort</w>": 597,
  "sa": 598,
  "save</w>": 599,
  "split</w>": 600,
  "create</w>": 601,
  "parse</w>": 602,
  "mer": 603,
  "merge</w>": 604,
  "parser</w>": 605,
  "datab": 606,
  "databa": 607,
  "database": 608,
  "databasemanager</w>": 609,
  "config": 610,
  "configloa": 611,
  "configloader</w>": 612,
  "validator": 613,
  "validator</w>": 614,
  "apicli": 615,
  "apiclient</w>": 616,
  "dataprocessor": 617,
  "dataprocessor</w>": 618,
  "cach": 619,
  "cache": 620,
  "cachemanager</w>": 621,
  "filehand": 622,
  "filehandler</w>": 623,
  "log": 624,
  "logger</w>": 625
}